app/views/status_mailer/new_status_email.html.erb

          <tbody>
          <% @status.tasks.each.with_index(1) do |task,index| %>
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."status_id" = $1  [["status_id", 22]]