app/views/statuses/index.html.erb

SELECT "statuses".* FROM "statuses"
SELECT COUNT(*) FROM "statuses"
---
                       <h3 class="d-flex align-items-center mb-0">
                          <%= pluralize(@statuses.count, "status") %>

SELECT "tasks".* FROM "tasks" WHERE "tasks"."status_id" = $1  [["status_id", 23]]
SELECT 1 AS one FROM "tasks" WHERE "tasks"."status_id" = $1 LIMIT $2  [["status_id", 26], ["LIMIT", 1]]
---
    <% @statuses.each do |status| %>
      <% if status.tasks.any? %>

SELECT "tasks".* FROM "tasks" WHERE "tasks"."status_id" = $1  [["status_id", 26]]
---
            <tbody>
                <% status.tasks.each.with_index(1) do |task,index| %>