app/views/statuses/show.html.erb

                             <h3 class="d-flex align-items-center mb-0">
                                <%= pluralize(@tasks.count, "task") %>
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."status_id" = $1  [["status_id", 10]]
SELECT COUNT(*) FROM "tasks" WHERE "tasks"."status_id" = $1  [["status_id", 18]]