app/controllers/statuses_controller.rb

SELECT COUNT(*) FROM "statuses"
SELECT "statuses".* FROM "statuses"
---
  def index
    @statuses = Status.paginate(page: params[:page], per_page: 2)

SELECT "statuses".* FROM "statuses" WHERE "statuses"."id" = $1 LIMIT $2  [["id", 26], ["LIMIT", 1]]
---
  def show
    @status = Status.find(params[:id])

INSERT INTO "statuses" ("date", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["date", "2021-08-07"], ["created_at", "2021-08-07 10:09:34.131237"], ["updated_at", "2021-08-07 10:09:34.131237"]]
---
  def create
    @status = Status.new(status_params)
    if @status.save

SELECT "statuses".* FROM "statuses" WHERE "statuses"."id" = $1 LIMIT $2  [["id", 23], ["LIMIT", 1]]
---
  def edit
    @status = Status.find(params[:id])

SELECT "statuses".* FROM "statuses" WHERE "statuses"."id" = $1 LIMIT $2  [["id", 23], ["LIMIT", 1]]
UPDATE "statuses" SET "updated_at" = $1 WHERE "statuses"."id" = $2  [["updated_at", "2021-09-06 06:38:31.683461"], ["id", 33]]
---
  def update
    @status = Status.find(params[:id])
    if params[:Preview]
      puts 'hello....'
    end
    if @status.update(status_params)

SELECT "statuses".* FROM "statuses" WHERE "statuses"."id" = $1 LIMIT $2  [["id", 25], ["LIMIT", 1]]
DELETE FROM "statuses" WHERE "statuses"."id" = $1  [["id", 25]]
---
  def destroy
    @status = Status.find(params[:id])
    @status.destroy